<h1>Циклы</h1>
<h2><i>Цикл с <u>предусловием</u></i></h2>
<?php
$a = 0;
while ($a < 10) {
    echo "$a <br>";
    $a++;
}
?>
<h2><i>Цикл с постусловием</i> - <u>do... while</u></h2>
<?php
do {
    echo "$a <br>";
    $a--;
} while ($a > 0)
?>
<h2><i>Цикл с параметром</i> - <u>for</u></h2> 
<?php
for($i = 0; $i < 10; $i++){
    echo "$i <br>";
}
?>
<h2><i>Вложенный цикл</i></h2>
<?php
for($i = 0; $i < 5; $i++){
  
    for($j = 0; $j < 20; $j++){
        echo '■';
}  
    echo'<br>';
}
?>
<h2><i>Операторы</i> <u>break</u> <i>и</i> <u>continue</u></h2>
<p>Немедленный выход из текущего цикла</p> <br>
<p>continue - переход к следующей итерации</p>