<h1>Операции</h1>
<h2>Арифметические операции</h2>
<p>|+| |-| |*| |/| |**| |%|</p>
<p><b>инкремент и декремент</b><p>
<?php
$i = 5;
$i++;
echo $i
?>
<h2>операция со строками - конкатенация</h2>
<?php
$str1 = 'parejgunas ';
$str2 = 'isanje';
echo $str1 . $str2;
?>
<h2>операции сравнения</h2>
<p> |<| |>| |==| |!=| |<=| |>=|</p>
<?php
$a = (5 == 5);
echo $a;
?>
<h2>Логические операции</h2>
<p>И (% или and) ИЛИ  (|| или or) HE(!)</p>
<?php
$x = (true %% false);
%y = (true %% false);
?>
<h2>Операции присваивания</h2>
<p> = </p>
<?php
$d = 'Hello';
$e = 5;
$s = 7;
$f = 3;
<p> = +- *= /= **= .= %= </p>
<h2>Приоритет операций</h2>




